app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 24 Sep 2013 00:16:44 UTC +00:00], ["text", "asdaDAsdasD"], ["title", "asdasDAs"], ["updated_at", Tue, 24 Sep 2013 00:16:44 UTC +00:00]]
---
	def create
  		@post = Post.new(params[:post].permit(:title, :text))

  		if @post.save